<h2> Pandas Basics </h2>

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

In [3]:
np.__version__

'1.23.5'

In [4]:
a1 = np.random.randint(5, size=5)

In [5]:
a1

array([1, 2, 3, 0, 1])

In [6]:
series1 = pd.Series(a1)

In [7]:
series1

0    1
1    2
2    3
3    0
4    1
dtype: int32

In [8]:
series2 = pd.Series(a1, index=['a','b','c','d','e'])
series2

a    1
b    2
c    3
d    0
e    1
dtype: int32

In [9]:
series2['a']

1

In [10]:
series2['d']

0

<b> Data frame </b>

In [12]:
dict = {
    "id" : [1,2,3,4],
    "name" : ["ankita", "murali", "abhishek", "amit"]
}
dict

{'id': [1, 2, 3, 4], 'name': ['ankita', 'murali', 'abhishek', 'amit']}

In [13]:
df = pd.DataFrame(dict)

In [14]:
df

   id      name
0   1    ankita
1   2    murali
2   3  abhishek
3   4      amit

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.columns

Index(['id', 'name'], dtype='object')

In [17]:
df.dtypes

id       int64
name    object
dtype: object

<b> Reading files </b>

In [18]:
df = pd.read_csv("students.csv")

In [19]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.dtypes

id             int64
name          object
quiz1          int64
quiz2          int64
assignment     int64
midsem         int64
compre         int64
dtype: object

In [22]:
df_excel = pd.read_excel("students.xlsx")

In [23]:
df_excel

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

<b> Writing to a file </b>

In [24]:
df_excel.to_csv("myOwndataframe.csv")

<b> Data Selection </b>

In [25]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [26]:
name = df.name

In [27]:
name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [28]:
type(name)

pandas.core.series.Series

In [29]:
assign = df["assignment"]

In [30]:
type(assign)

pandas.core.series.Series

In [31]:
list_of_col = ["id", "name", "compre"]
extracted_df = df[list_of_col]

In [32]:
extracted_df

   id    name  compre
0   1  pravin      34
1   2   patil       4
2   3    john      33
3   4   sadiq      11
4   5  pravin      34

In [33]:
type(extracted_df)

pandas.core.frame.DataFrame

In [35]:
type(extracted_df["id"])

pandas.core.series.Series

In [36]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [37]:
df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4

In [38]:
df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [39]:
df.describe

<bound method NDFrame.describe of    id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34>

In [40]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [41]:
df.iloc[1,0]

2

In [42]:
df.iloc[1,1]

'patil'

In [43]:
df.iloc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [44]:
df.iloc[0,1]

'pravin'

In [45]:
df.iloc[0,2]

5

In [47]:
df.iloc[0:3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33

In [48]:
df["name"]

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [49]:
df.loc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [50]:
df.loc[0, "id"]

1

In [51]:
df.loc[0, ["id","name"]]

id           1
name    pravin
Name: 0, dtype: object

In [52]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [53]:
df[df.quiz1 > 3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [54]:
df[(df.quiz1 > 3) & (df.assignment > 7) ]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [64]:
df[(df.quiz1 > 3) & (df.assignment > 7) ]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [56]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [57]:
df.query('quiz1 > 3')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [62]:
df.query('quiz1 > 3 or quiz2 > 5')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34